frontend/controllers/AppointmentController.php

    public function actionCreate()
    {
        $model = new TblAppointment();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `appointment` (`appt_id`, `patient_id`, `dr_id`, `appointment_date`, `recep_id`, `symptoms_list`) VALUES ('01', '01', '01', '2006-10-10', '01', 'ewan ko ba')