common/models/User.php

    public static function findIdentity($id): User|null
    {
        $user = static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`id`=1) AND (`status`=10)

    public static function findByUsername(string $username): User|null
    {
        $user = static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`username`='xiena') AND (`status`=10)