frontend/views/appointment/index.php

SELECT COUNT(*) FROM `tbl_appointment`
---
        <?= Html::a('<i class="fas fa-calendar-plus"></i> Book Appointment', ['create'], ['class' => 'btn btn-primary']) ?>
    </p>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'tableOptions' => ['class' => 'table table-striped table-hover'],
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],
            'appt_id',
            [
                'label' => 'Doctor',
                'value' => function($model) {
                    return $model->doctor ? 'Dr. ' . $model->doctor->first_name . ' ' . $model->doctor->last_name : 'N/A';
                },
            ],
            [
                'attribute' => 'appointment_date',
                'format' => 'raw',
                'value' => function($model) {
                    return $model->appointment_date ? Yii::$app->formatter->asDate($model->appointment_date, 'medium') : '<span class="text-warning">Pending</span>';
                },
            ],
            [
                'attribute' => 'appointment_time',